In [1]:
import pandas as pd
import numpy as np

## Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [3]:
data.duplicated() 
# Restitute un array che contiene True se una riga è duplicata (rispetto quelle precedenti)

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [4]:
# 'drop_duplicates()' restituisce un DataFrame dove il array duplicated è falso
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [5]:
data['v1'] = range(7)
# 'drop_duplicates()' considera tutte le colonne ma si è possibile specificare anche una sottorete (le colonne)
# per le quale si vuole determinate i duplicati.
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [7]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')
# Utilizzando il parametro 'keep' è possibile specificare di mantenere l'ultima istanza duplicata

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping

In [10]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [11]:
# Supponino di voler aggiungere una colonna che indica il tipo di animale di provenienza del cibo
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [13]:
# Si può notare che alcuni valori nel dataset hanno la prima lettera in maiuscolo e quindi non sarebbe
# possibile effettuare il match con il dizionario 'meat_to_animal'. La soluzione è utilizzare la funzione 
# 'str.lower' per convertire ogni valore in lowercase
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [15]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [16]:
# Si poteva anche fare con una funzione che fa tutto il lavoro
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [17]:
# La funzione 'replace' a differenza di 'map' è più semplice e flessibile
data = pd.Series([1., -999, 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [18]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [19]:
# E' possibile sostituire più valori passando una lista
data.replace([-999, -1000.], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [20]:
# Inoltre è possibile sostituire i valori con più di uno utilizzando sempre una lista
data.replace([-999, -1000.], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [22]:
# Inoltre è possibile passare un dizionario
data.replace({-999 : np.nan, -1000 : 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
transform = lambda x : x[:4].upper() # x[:4] indica i quattro caratteri, x[:3 indicherebbere i primi 3]
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [42]:
# Per modificare il nome degli indici (modifica in-place)
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [45]:
# Per creare una nuova versione senza modificare la precedente, si può utilizzare 'rename'
# 'index' specifica le righe mentre 'columns' le colonne
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [46]:
# Si può anche utilizzare un dizionario con ad esempio una sottorete di valori
data.rename(index = {'OHIO' : 'INDIANA'}, columns = {'three' : 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [48]:
# Il dataset è rinominabile anche in-place
data.rename(index = {'OHIO' : 'INDIANA'}, inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [50]:
# Supponiamo di avete un array di età
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
# E di volerlo dividere in gruppi cha vanno da 18 a 25, da 26 a 35 e da 36 a 61 e oltre. 
# Per farlo si usa la funzione cat
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [51]:
# L'oggetto restituito è un oggetto di tipo 'Categorical'. 
cats.codes # Ritorna la posizione di ogni elemento dell'array nei bins

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [52]:
cats.categories # Ritorna le categorie

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [53]:
pd.value_counts(cats) # Conta i valori per ogni categoria

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [54]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False) # L'intervallo destro diventa non inclusivo

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [59]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names)
# Possiamo modificare i nomi dei valori basandosi al bins di appartenenza

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [62]:
data = np.random.rand(20)
pd.cut(data, 4 , precision = 2) 
# Passando un valore intero invece che un esplicito array con i valori il metodo calcolerà in automatico
# i valori degli intervalli basandosi sul valore minimo e massimo
# 'precision' stabilisce la precisione con la quale vengono calcolati gli intervalli

[(0.63, 0.83], (0.036, 0.23], (0.63, 0.83], (0.23, 0.43], (0.23, 0.43], ..., (0.23, 0.43], (0.036, 0.23], (0.036, 0.23], (0.23, 0.43], (0.43, 0.63]]
Length: 20
Categories (4, interval[float64]): [(0.036, 0.23] < (0.23, 0.43] < (0.43, 0.63] < (0.63, 0.83]]

In [69]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
# La funzione 'qcut' a differenza di 'cut' usando dei quantili genera bins che contengono più o meno lo 
# stesso numero di istanze
pd.value_counts(cats)

(0.744, 2.796]      250
(0.0105, 0.744]     250
(-0.703, 0.0105]    250
(-3.028, -0.703]    250
dtype: int64

In [70]:
# Similmente a 'cut' è possibile passare dei quantili scelti (numeri compresi tra 0 e 1)
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.254, 0.0105], (1.293, 2.796], (0.0105, 1.293], (0.0105, 1.293], (-1.254, 0.0105], ..., (-1.254, 0.0105], (-1.254, 0.0105], (0.0105, 1.293], (-3.028, -1.254], (-1.254, 0.0105]]
Length: 1000
Categories (4, interval[float64]): [(-3.028, -1.254] < (-1.254, 0.0105] < (0.0105, 1.293] < (1.293, 2.796]]

## Detectiong and Filtering Outliers

In [77]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003355    -0.056315    -0.001276    -0.023760
std       0.998788     0.964742     1.029970     0.997168
min      -3.302558    -3.061218    -3.448969    -2.849895
25%      -0.682739    -0.725611    -0.696285    -0.737893
50%       0.007746     0.021665    -0.007814    -0.001409
75%       0.705320     0.618284     0.730820     0.670742
max       3.471089     3.199042     3.207047     3.080048

In [78]:
col = data[2]
# Si i supponga che vuole cercare i valori che eccedono di tre in valore assoluto
col[np.abs(col) > 3]

253   -3.093220
519   -3.448969
921    3.207047
Name: 2, dtype: float64

In [81]:
# Per selezionare tutte le righe che hanno un valore che eccede di 3 o -3 si può usare il metodo 'any' sul valore
# booleano
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
25  -3.302558 -2.436966  0.861405  0.047733
67   1.262778 -3.061218 -0.060871  0.410512
253 -0.455896 -1.260694 -3.093220 -1.387044
519 -0.731699 -0.991646 -3.448969 -0.125191
581 -0.908072 -3.049497  0.452372 -0.689192
627  3.014135 -0.303182 -0.895036 -1.713836
702  3.471089  1.588889 -0.243578  0.412835
750  3.133515  0.532538 -0.367698 -0.951880
780  0.821596  3.199042  0.374147  0.405341
921 -2.441925 -1.475728  3.207047 -0.409495
940 -0.380237 -0.144744 -0.476194  3.080048

In [83]:
data[(np.abs(data) > 3 )] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.003039    -0.056403    -0.000941    -0.023840
std       0.995849     0.963748     1.027660     0.996921
min      -3.000000    -3.000000    -3.000000    -2.849895
25%      -0.682739    -0.725611    -0.696285    -0.737893
50%       0.007746     0.021665    -0.007814    -0.001409
75%       0.705320     0.618284     0.730820     0.670742
max       3.000000     3.000000     3.000000     3.000000

In [85]:
# 'sign()' produce i valori di 1 e -1 basandosi se il valore è positivo o negativo
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0  1.0 -1.0  1.0
4  1.0 -1.0  1.0  1.0